# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "caskroom/fonts"
tap "mas-cli/tap"
tap "ojford/formulae"

# Brew packages
brew "git-crypt"
brew "gnupg"
brew "mas"
brew "tmux"
brew "stow"
brew "httpie"
brew "ripgrep"
brew "loginitems"
brew "dockutil"
brew "tree"
brew "nmap"
brew "jq"
brew "python"
brew "ruby"
brew "golang"
brew "libav"

# Casks
cask "alfred"
cask "caffeine"
cask "dash"
cask "iterm2"
cask "bettertouchtool"
cask "yujitach-menumeters"
cask "karabiner-elements"
cask "fugu"
cask "font-source-code-pro-for-powerline"

# Dislocker (FUSE + Microsoft Bitlocker) requires osxfuse cask
cask "osxfuse"
brew "dislocker"

# App Store
mas 'Microsoft Remote Desktop 10', id: 1295203466
mas 'Twitterrific', id: 1289378661
mas 'Todoist', id: 585829637
