# Taps
tap "homebrew/cask"
tap "mas-cli/tap"
tap "ojford/formulae"
tap "puppetlabs/puppet"

# Brew packages
brew "git-crypt"
brew "gnupg"
brew "mas"
brew "tmux"
brew "stow"
brew "httpie"
brew "ripgrep"
brew "loginitems"
brew "tree"
brew "pstree"
brew "htop"
brew "nmap"
brew "rename"
brew "wget"
brew "jq"
brew "lsd"
brew "yt-dlp"
brew "bat"
brew "visionmedia-watch"
brew "timewarrior"
brew "atuin"
brew "hyfetch"
brew "macchina"

# Casks
cask "1password"
cask "alfred"
cask "keepingyouawake"
cask "dash"
cask "iterm2-beta"
cask "bettertouchtool"
cask "grandperspective"
cask "joplin"
cask "menumeters"
cask "karabiner-elements"
cask "fugu"
cask "plex"
cask "mysides"
cask "nextcloud"
cask "airtame"
cask "gas-mask"
cask "font-hack-nerd-font"
cask "powershell"
cask "secretive"
cask "safari-technology-preview"
cask "microsoft-edge"
cask "firefox-beta"
cask "activitywatch"
cask "google-drive"
cask "visual-studio-code"
cask "pe-client-tools"
cask "istat-menus"
cask "aldente"

# App Store
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Bitwarden', id: 1352778147
mas '1Password for Safari', id: 1569813296
mas 'AmorphousDiskMark', id: 1168254295
mas 'VMWare Remote Console', id: 1230249825
mas 'Windows App', id: 1295203466
mas 'Boop', id: 1518425043
mas 'Tot', id: 1491071483
